app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
    def index
        lists = List.all

INSERT INTO "lists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "AN"], ["user_id", 2], ["created_at", "2022-08-04 12:51:22.197883"], ["updated_at", "2022-08-04 12:51:22.197883"]]
---
      def create
        # byebug
        list = List.create(list_params)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      def show
        list = List.find_by(id: params[:id])