app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "q"], ["password_digest", "[FILTERED]"], ["email", "q"], ["created_at", "2022-08-06 17:40:20.226195"], ["updated_at", "2022-08-06 17:40:20.226195"]]
---
    def create
       user = User.new(user_params)
        if user.valid? && params[:password] == params[:password_confirmation]
            user.save!